Revit 2027 API
BuiltInFailures.SketchFailures.TrussSegmentedReference Property
 Truss reference must form a continuous chain of one or more sketch lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussSegmentedReference { get; }
Public Shared ReadOnly Property TrussSegmentedReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussSegmentedReference {
	FailureDefinitionId^ get ();
}
static member TrussSegmentedReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace